.doom.d/config.org
* My other configs
** Automatic screenshot insertion
This is already supported by: org-screenshot-take
#+BEGIN_SRC emacs-lisp
;; (defun my-org-screenshot ()
;;   "Take a screenshot into a time stamped unique-named file in the
;; same directory as the org-buffer and insert a link to this file."
;;   (interactive)
;;   (setq filename
;;         (concat
;;          (make-temp-name
;;           (concat (buffer-file-name)
;;                   "_"
;;                   (format-time-string "%Y%m%d_%H%M%S_")) ) ".png"))
;;   (call-process "import" nil nil nil filename)
;;   (insert (concat "[[" filename "]]"))
;;   (org-display-inline-images))
#+END_SRC

** Org config
#+BEGIN_SRC emacs-lisp
(after! org
  (setq
   org-bullets-bullet-list '("⁖")
   org-ellipsis " ... "
   ))
#+END_SRC

** Line no
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
(setq doom-font (font-spec :family "CaskaydiaCove Nerd Font Mono" :size 29))
(setq org-log-done 'time)
#+end_src
